src/cf/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОтветственныеЛицаОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ответственных лиц по заданной организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации -
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Поля:
//	* Период - Дата -
//	* Организация - СправочникСсылка.Организации -
//	* ОтветственноеЛицо - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций -
//	* Сотрудник - СправочникСсылка.Сотрудники -
Функция ТаблицаПоОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Период,
		|	Т.Организация,
		|	Т.ОтветственноеЛицо,
		|	Т.Сотрудник
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций КАК Т
		|ГДЕ
		|	Т.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ОтветственноеЛицо
		|АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Организация", Организация);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
